# Folder Item Info Element Id Property

Source: https://www.revitapidocs.com/2026/7f892bab-a50d-f9ce-f7a4-6b1f43e6c31c.htm

---

| Folder Item Info Element Id Property |
| --- |

**Note: This API is now obsolete.**

The folder parameter Id
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")]
public ElementId ElementId { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")>
Public ReadOnly Property ElementId As ElementId
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")]
property ElementId^ ElementId {
	ElementId^ get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")>]
member ElementId : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

FolderItemInfo Class Autodesk.Revit.DB Namespace